#This was mob code

In [67]:
from sqlalchemy import create_engine
import pandas as pd
import seaborn as sns
from matplotlib import pyplot as plt
import geopandas as gpd

In [53]:
database_name= 'scooters'
connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"
engine = create_engine(connection_string)

EDA

In [11]:
query = '''
SELECT *
FROM scooters
LIMIT 100;
'''

pd.read_sql(query, con = engine)

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird
...,...,...,...,...,...,...,...,...,...
95,2019-05-01 00:01:41.247,36.141158,-86.801997,PoweredWDMWW,Powered,69.0,scooter,0.0,Bird
96,2019-05-01 00:01:41.247,36.138786,-86.801667,PoweredSNB79,Powered,88.0,scooter,0.0,Bird
97,2019-05-01 00:01:41.247,36.162634,-86.781603,PoweredM69E2,Powered,91.0,scooter,0.0,Bird
98,2019-05-01 00:01:41.247,36.144795,-86.795576,PoweredHY38F,Powered,88.0,scooter,0.0,Bird
99,2019-05-01 00:01:41.247,36.165809,-86.777780,Powered2WLYW,Powered,98.0,scooter,0.0,Bird

In [12]:
with engine.connect() as connection:
    scooters = pd.read_sql(query, con = connection)

scooters.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-01 00:01:41.247,36.136822,-86.799877,PoweredLIRL1,Powered,93.0,scooter,0.0,Bird
1,2019-05-01 00:01:41.247,36.191252,-86.772945,PoweredXWRWC,Powered,35.0,scooter,0.0,Bird
2,2019-05-01 00:01:41.247,36.144752,-86.806293,PoweredMEJEH,Powered,90.0,scooter,0.0,Bird
3,2019-05-01 00:01:41.247,36.162056,-86.774688,Powered1A7TC,Powered,88.0,scooter,0.0,Bird
4,2019-05-01 00:01:41.247,36.150973,-86.783109,Powered2TYEF,Powered,98.0,scooter,0.0,Bird

In [13]:
with engine.connect() as connection:
    scooters = pd.read_sql(query, con = connection)
scooters.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   pubdatetime  100 non-null    datetime64[ns]
 1   latitude     100 non-null    float64
 2   longitude    100 non-null    float64
 3   sumdid       100 non-null    object
 4   sumdtype     100 non-null    object
 5   chargelevel  100 non-null    float64
 6   sumdgroup    100 non-null    object
 7   costpermin   100 non-null    float64
 8   companyname  100 non-null    object
dtypes: datetime64[ns](1), float64(4), object(4)
memory usage: 7.2+ KB

In [14]:
totalscooters = '''
SELECT COUNT (DISTINCT (sumdid))
FROM scooters;
'''

scootercount = pd.read_sql(totalscooters, con = engine)
scootercount

   count
0  10018

In [15]:
eachcompanycount='''
SELECT companyname, COUNT(DISTINCT(sumdid))
FROM scooters
GROUP BY companyname;
'''
companycount= pd.read_sql(eachcompanycount, con=engine)
companycount

  companyname  count
0        Bird   3860
1        Bolt    360
2      Gotcha    224
3        Jump   1210
4        Lime   1824
5        Lyft   1735
6        Spin    805

In [16]:
timeframe= '''
SELECT MIN (pubdatetime), MAX(pubdatetime)
FROM scooters;
'''
scooterstimeframe= pd.read_sql(timeframe, con=engine)
scooterstimeframe

                      min                 max
0 2019-05-01 00:01:41.247 2019-07-31 23:59:57

In [17]:
SUMGRP ='''
SELECT SUMDGROUP
FROM scooters 
GROUP BY SUMDGROUP
'''

GROUPTYPE = pd.read_sql_query(SUMGRP, engine)
GROUPTYPE

  sumdgroup
0   bicycle
1   scooter
2   Scooter

In [18]:
JUSTSCOOTERS = '''
SELECT *
FROM scooters
WHERE UPPER(SUMDGROUP) = 'SCOOTER'
AND SUMDID = 'Powered3c24659f-37f5-5549-895c-bccf6d1ab656'
'''
SCOOTERSONLY = pd.read_sql_query(JUSTSCOOTERS , engine)
SCOOTERSONLY.head()

,pubdatetime,latitude,longitude,sumdid,sumdtype,chargelevel,sumdgroup,costpermin,companyname
0,2019-05-17 10:17:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
1,2019-05-17 10:22:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
2,2019-05-17 10:27:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
3,2019-05-17 10:32:12,36.1204,-86.7533,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,1.0,scooter,0.0,Jump
4,2019-05-18 14:03:13,36.1538,-86.7957,Powered3c24659f-37f5-5549-895c-bccf6d1ab656,Powered,0.0,scooter,0.0,Jump

1a. How many scooters each company have in this time frame?

In [21]:
TOTALSCOOTERS = '''
SELECT COMPANYNAME,
COUNT(DISTINCT(SUMDID)) COUNTS
FROM scooters
WHERE UPPER(SUMDGROUP) = 'SCOOTER'
GROUP BY
COMPANYNAME
'''
SCOOTERCOUNT = pd.read_sql_query(TOTALSCOOTERS, engine)
SCOOTERCOUNT

  companyname  counts
0        Bird    3860
1        Bolt     360
2      Gotcha     224
3        Jump    1210
4        Lime    1818
5        Lyft    1735
6        Spin     805

1b.Did the number for each company change over time?

In [19]:
JUSTSCOOTERS = '''
SELECT *
FROM scooters
WHERE UPPER(SUMDGROUP) = 'SCOOTER'
AND SUMDID = 'Powered3c24659f-37f5-5549-895c-bccf6d1ab656'
'''
SCOOTERSONLY = pd.read_sql_query(JUSTSCOOTERS , engine)
SCOOTERSONLY.head()
JUSTSCOOTERS1 = '''
SELECT 
UPPER(SUMDGROUP),
UPPER(COMPANYNAME) COMPANYNAME,
TO_CHAR(PUBDATETIME,'MM') MONTH_NUM,
TO_CHAR(PUBDATETIME,'MONTH') MONTH_NAME,
TO_CHAR(PUBDATETIME,'YYYY') YEAR_VAL,
COUNT(DISTINCT(SUMDID))
FROM SCOOTERS 
WHERE 
UPPER(SUMDGROUP) = 'SCOOTER'
---SUMDID ='Powered3c24659f-37f5-5549-895c-bccf6d1ab656'
GROUP BY
UPPER(COMPANYNAME),
UPPER(SUMDGROUP),
TO_CHAR(PUBDATETIME,'MM'),
TO_CHAR(PUBDATETIME,'MONTH'),
TO_CHAR(PUBDATETIME,'YYYY')
ORDER BY
UPPER(COMPANYNAME),
UPPER(SUMDGROUP),
TO_CHAR(PUBDATETIME,'MM'),
TO_CHAR(PUBDATETIME,'MONTH'),
TO_CHAR(PUBDATETIME,'YYYY')
'''

SCOOTERSONLY1 = pd.read_sql_query(JUSTSCOOTERS1 , engine)
SCOOTERSONLY1

      upper companyname month_num month_name year_val  count
0   SCOOTER        BIRD        05  MAY           2019   3064
1   SCOOTER        BIRD        06  JUNE          2019   2910
2   SCOOTER        BIRD        07  JULY          2019   2583
3   SCOOTER        BOLT        05  MAY           2019    346
4   SCOOTER        BOLT        06  JUNE          2019    333
5   SCOOTER        BOLT        07  JULY          2019    276
6   SCOOTER      GOTCHA        05  MAY           2019    223
7   SCOOTER      GOTCHA        06  JUNE          2019    223
8   SCOOTER      GOTCHA        07  JULY          2019    224
9   SCOOTER        JUMP        05  MAY           2019    976
10  SCOOTER        JUMP        06  JUNE          2019   1036
11  SCOOTER        JUMP        07  JULY          2019   1206
12  SCOOTER        LIME        05  MAY           2019   1631
13  SCOOTER        LIME        06  JUNE          2019   1455
14  SCOOTER        LIME        07  JULY          2019    902
15  SCOOTER        LYFT        05  MAY           2019   1376
16  SCOOTER        LYFT        06  JUNE          2019   1152
17  SCOOTER        LYFT        07  JULY          2019   1026
18  SCOOTER        SPIN        05  MAY           2019    687
19  SCOOTER        SPIN        06  JUNE          2019    713
20  SCOOTER        SPIN        07  JULY          2019    570

1c. Did scooter usage vary by company?

2.According to Second Substitute Bill BL2018-1202 (as amended) (https://web.archive.org/web/20181019234657/https://www.nashville.gov/Metro-Clerk/Legislative/Ordinances/Details/7d2cf076-b12c-4645-a118-b530577c5ee8/2015-2019/BL2018-1202.aspx), all permitted operators will first clean data before providing or reporting data to Metro. Data processing and cleaning shall include:
Removal of staff servicing and test trips
Removal of trips below one minute
Trip lengths are capped at 24 hours
Are the scooter companies in compliance with the second and third part of this r

Gotcha and Jump ule?

In [37]:
TRIPSCOOTER = '''
SELECT 'over 24' as status, companyname
FROM trips
WHERE tripduration > 1440
GROUP BY companyname
UNION
SELECT 'under 1 minute' as status, companyname
FROM trips
WHERE tripduration < 1
GROUP BY companyname
ORDER BY status
'''
scooterstriptime= pd.read_sql_query(TRIPSCOOTER, engine)
scooterstriptime

           status    companyname
0         over 24           SPIN
1         over 24  Bolt Mobility
2         over 24           Lyft
3  under 1 minute           Bird
4  under 1 minute           Lime
5  under 1 minute           Lyft

In [41]:
COMPLIANCE ='''
SELECT UPPER(companyname) COMPANYNAME
FROM TRIPS WHERE  UPPER(companyname) NOT IN 
(SELECT  COMPANYNAME FROM
(
SELECT UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration > 1440
UNION
SELECT 
UPPER(companyname) COMPANYNAME
FROM TRIPS
WHERE tripduration < 1) 
GROUP BY COMPANYNAME)
GROUP BY
UPPER(companyname) 
'''
COMPLIANT= pd.read_sql_query(COMPLIANCE, engine)
COMPLIANT

  companyname
0      GOTCHA
1        JUMP

3. The goal of Metro Nashville is to have each scooter used a minimum of 3 times per day. Based on the data, what is the average number of trips per scooter per day? Make sure to consider the days that a scooter was available. How does this vary by company?

In [55]:
AVGUSAGE= '''
WITH avg_count AS (
SELECT companyname, sumdid, ROUND(AVG(scooter_usage.sumdid_count),2) as avg_sumdid_count
FROM (
SELECT companyname, sumdid, DATE(create_dt) as usage_date, COUNT (*) as sumdid_count
FROM trips
GROUP BY sumdid, DATE(create_dt), companyname
	) as scooter_usage
GROUP BY sumdid, companyname
ORDER BY avg_sumdid_count DESC
)
SELECT companyname, sumdid, avg_sumdid_count
FROM avg_count
WHERE avg_sumdid_count >= 3.0
'''
AVGUSAGEBYDAY= pd.read_sql_query(AVGUSAGE, engine)
AVGUSAGEBYDAY

,companyname,sumdid,avg_sumdid_count
0,JUMP,Poweredb671ffe4-2bca-5880-98ec-d36f65aa11a2,159.00
1,Bird,PoweredUNKNOWN,41.06
2,Lyft,Powered487723,21.50
3,Lime,PoweredEGRN7CFK6Q6K2,18.40
4,Gotcha,Powered569,18.00
...,...,...,...
2748,Bird,Powered2GR7G,3.00
2749,Bolt Mobility,Powered-44c78418-a8f1-ff86-c13e-eb8fdb8ddd6c,3.00
2750,Bird,PoweredBCB85,3.00
2751,Gotcha,Powered772,3.00
2752,Bird,PoweredEMPL7,3.00

In [59]:
SCOOTERUSAGEAVGCOM = '''
WITH X AS (
SELECT
COMPANYNAME,
MAX(STARTDATE)-MIN(STARTDATE) TOTALDAYS,
COUNT(DISTINCT(SUMDID)) TOTALSCOOTERS,
COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE)) SCOOTERTOTALDAYS,
SUM(COUNTRECNUM) TOTALUSES,
CASE WHEN SUM(COUNTRECNUM) = 0 THEN 0 ELSE
SUM(COUNTRECNUM)/(COUNT(DISTINCT(SUMDID)) * (MAX(STARTDATE)-MIN(STARTDATE)))
END AVG_USE_DAY
FROM(
SELECT 
UPPER(COMPANYNAME) COMPANYNAME,
STARTDATE,
SUMDID,
COUNT(TRIPRECORDNUM) COUNTRECNUM
FROM
TRIPS T
WHERE SUMDID IN
(SELECT SUMDID FROM SCOOTERS WHERE UPPER(SUMDGROUP) ='SCOOTER')
AND T.tripduration > 1 AND T.tripduration < 1440 AND TRIPRECORDNUM IS NOT NULL
GROUP BY 
UPPER(COMPANYNAME),
STARTDATE,
SUMDID
HAVING COUNT(TRIPRECORDNUM) > 1
ORDER BY STARTDATE,UPPER(COMPANYNAME))
GROUP BY COMPANYNAME
)
SELECT COMPANYNAME, round(AVG_USE_DAY,2) AVG_USE_DAY FROM X 
'''
USESCOOTERCOM = pd.read_sql_query(SCOOTERUSAGEAVGCOM, engine)
USESCOOTERCOM

     companyname  avg_use_day
0           BIRD         0.32
1  BOLT MOBILITY         0.48
2         GOTCHA         0.24
3           JUMP         0.17
4           LIME         1.35
5           LYFT         0.69
6           SPIN         0.48

In [64]:
bus_stops = pd.read_csv('..\data\Regional_Transportation_Authority_Bus_Stops.csv')

In [65]:
bus_stops.head()

,Stop ID Number,Stop Abbreviation,Stop Name,Bench,Shelter,Line Number,Line Name,Mapped Location
0,4418,MCC4_20,MUSIC CITY CENTRAL 4TH - BAY 20,False,True,94,CLARKSVILLE EXPRESS,"(36.166545, -86.781895)"
1,4422,MCC5_6,MUSIC CITY CENTRAL 5TH - BAY 6,True,True,94,CLARKSVILLE EXPRESS,"(36.166501, -86.781233)"
2,4249,21WE,21ST AVE PAST WEST END AVE SB,False,False,87,GALLATIN EXPRESS,"(36.149489, -86.800523)"
3,4184,MCSMJ,MUSIC CITY STAR MT. JULIET STATION,True,True,90,MUSIC CITY STAR,"(36.199912, -86.517904)"
4,4425,MCC5_8,MUSIC CITY CENTRAL 5TH - BAY 8,False,True,92,HENDERSONVILLE EXPRESS,"(36.166768, -86.781424)"

In [66]:
bus_stops.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Stop ID Number     88 non-null     int64
 1   Stop Abbreviation  88 non-null     object
 2   Stop Name          88 non-null     object
 3   Bench              88 non-null     bool
 4   Shelter            88 non-null     bool
 5   Line Number        88 non-null     int64
 6   Line Name          88 non-null     object
 7   Mapped Location    88 non-null     object
dtypes: bool(2), int64(2), object(4)
memory usage: 4.4+ KB